/*
-- Odin JavaScript --------------------------------------------------------------------------------
    Phyllia - Magatia (GMS Like)
-- Version Info -----------------------------------------------------------------------------------
    1.1 - Shortened by Moogra
    1.0 - First Version by Maple4U
---------------------------------------------------------------------------------------------------
*/

function start() {
    cm.sendOk("炼金术士和妖精之间虽然有不少误会，但在杰纽米斯会长的庇护下，我仍然可以留在玛加提亚。只要专心研究，怪物结晶也能成为很有价值的材料。");
    cm.dispose();
}
