/**
 *9201098 - Lukan
 *@author Ronan
 */

function start() {
    if (cm.getQuestStatus(8223) == 2) {
        if (cm.haveItem(3992041)) {
            cm.sendOk("我们这些昔日的守护者正在要塞内殿集结，准备向扭曲大师和他们的军队发起反击。准备好了就来加入我们吧。");
        } else {
            if (!cm.canHold(3992041)) {
                cm.sendOk("请在背包的设置栏留出一个空位，我要给你的钥匙非常重要。没有它，就无法进入要塞内部的圣所。");
            } else {
                cm.sendOk("所以你确实把钥匙弄丢了，是吗？好吧，我再给你一把。请务必保管好，要进入要塞内部圣所，这把钥匙必不可少。");
                cm.gainItem(3992041, 1);
            }
        }
    } else {
        cm.sendOk("哦，勇敢的冒险者。我是绯红要塞昔日的风暴骑士，曾守护这片古老土地。如今扭曲大师的士兵四处威胁旅人，请助我们守住这里。");
    }

    cm.dispose();
}